test_1 = {
    'Мужской': [
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы доминант, сторонник патриархального уклада семьи. Окончательные решения зачастую принимаете единолично. \n\n'
                    '2. Вы сторонник равноправия, придаете мнению партнера равное своему значение.',
            'btns': [
                {
                    'text': 'Я доминант',
                    'value': '1'
                },
                {
                    'text': 'Я сторонник равноправия',
                    'value': '2'
                }
            ]
        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы консервативны, предпочитаете партнера традиционных взглядов и ценностей. \n\n'
                    '2. Вы прогрессивны, не имеете предрассудков в отношении нестандартной  внешности, поведения и прочих способов самовыражения своего партнера.',
            'btns': [
                {
                    'text': 'Я консервативен',
                    'value': '1'
                },
                {
                    'text': 'Я прогрессивен',
                    'value': '2'
                }
            ]
        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы избирательный собеседник, цените партнера за широту кругозора, умение вести содержательные беседы. \n\n'
                    '2. Вы универсальный собеседник, больше цените личные качества, легко идете на контакт.',
            'btns': [
                {
                    'text': 'Я избирательный собеседник',
                    'value': '1'
                },
                {
                    'text': 'Я универсальный собеседник',
                    'value': '2'
                }
            ]
        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Не приемлите нарушение партнером границ личного пространства. Для Вас важно сохранить часть жизни без присутвия в ней партнера. \n\n'
                    '2. Вы увлеченный отношениями человек, считаете партнера частью своего личного пространства.',
            'btns': [
                {
                    'text': 'Вариант 1',
                    'value': '1'
                },
                {
                    'text': 'Вариант 2',
                    'value': '2'
                }
            ]
        }
    ],
    'Женский': [
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы сторонница равноправия, своенравна, обладаете лидерскими качествами и инициативой, желаете активно, наравне с партнером учавствовать в принятии решений. \n\n'
                    '2. Вы уступчивы, склонны идти на компромиссы. Готовы видеть в партнере лидера.',
            'btns': [
                {
                    'text': 'Я сторонница равноправия',
                    'value': '1'
                },
                {
                    'text': 'Я уступчива',
                    'value': '2'
                }
            ]

        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы консервативны, предпочитаете партнера традиционных взглядов и ценностей. \n\n'
                    '2. Вы прогрессивны, не имеете предрассудков в отношении нестандартной  внешности, поведения и прочих способов самовыражения своего партнера.',
            'btns': [
                {
                    'text': 'Я консервативна',
                    'value': '1'
                },
                {
                    'text': 'Я прогрессивна',
                    'value': '2'
                }
            ]
        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Вы избирательный собеседник, цените партнера за широту кругозора, умение вести содержательные беседы. \n\n'
                    '2. Вы универсальный собеседник, больше цените личные качества, легко идете на контакт.',
            'btns': [
                {
                    'text': 'Я избирательный собеседник',
                    'value': '1'
                },
                {
                    'text': 'Я универсальный собеседник',
                    'value': '2'
                }
            ]
        },
        {
            'text': '*Выберите один из вариантов, который считаете наиболее приемлемым в отношении себя. 👇👇 * \n\n'
                    '1. Не приемлите нарушение партнером границ личного пространства. Для Вас важно сохранить часть жизни без присутвия в ней партнера. \n\n'
                    '2. Вы увлеченный отношениями человек, считаете партнера частью своего личного пространства.',
            'btns': [
                {
                    'text': 'Вариант 1',
                    'value': '1'
                },
                {
                    'text': 'Вариант 2',
                    'value': '2'
                }
            ]
        }
    ]
}

test_2 = {
    'text': '*Выбери одно из двух качеств, наиболее присущих твоему характеру* 👇👇',
    'Мужской': [
        [
            {
                'text': 'Злопамятен',
                'value': '1'
            },
            {
                'text': 'Отходчив',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Прямолинеен',
                'value': '1'
            },
            {
                'text': 'Учтив',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Забывчив',
                'value': '1'
            },
            {
                'text': 'Предусмотрителен',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Тяжел на подъем',
                'value': '1'
            },
            {
                'text': 'Легок на подъем',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Ревнив',
                'value': '1'
            },
            {
                'text': 'Не ревнив',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Всыпльчив',
                'value': '1'
            },
            {
                'text': 'Сдержан',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Откладываю дела',
                'value': '1'
            },
            {
                'text': 'Стараюсь не откладывать',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Щедрый',
                'value': '1'
            },
            {
                'text': 'Экономный',
                'value': '2'
            }
        ]
    ],
    'Женский': [
        [
            {
                'text': 'Злопамятна',
                'value': '1'
            },
            {
                'text': 'Отходчива',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Прямолинейна',
                'value': '1'
            },
            {
                'text': 'Учтива',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Забывчива',
                'value': '1'
            },
            {
                'text': 'Предусмотрительна',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Тяжела на подъем',
                'value': '1'
            },
            {
                'text': 'Легка на подъем',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Ревнива',
                'value': '1'
            },
            {
                'text': 'Не ревнива',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Всыпльчива',
                'value': '1'
            },
            {
                'text': 'Сдержана',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Откладываю дела',
                'value': '1'
            },
            {
                'text': 'Стараюсь не откладывать',
                'value': '2'
            }
        ],
        [
            {
                'text': 'Расточительна',
                'value': '1'
            },
            {
                'text': 'Экономна',
                'value': '2'
            }
        ]
    ]
}

test_3 = [
    {
        'text': 'Соц сети',
        'value': '1'
    },
    {
        'text': 'Фильмы',
        'value': '1'
    },
    {
        'text': 'Развлечения',
        'value': '1'
    },
    {
        'text': 'Проф развитие',
        'value': '1'
    },
    {
        'text': 'Творчество',
        'value': '4'
    },
    {
        'text': 'Спорт',
        'value': '2'
    },
    {
        'text': 'Саморазвитие',
        'value': '3'
    },
    {
        'text': 'Чтение',
        'value': '3'
    }
]

test_4 = [
    {
        'text': '*Допустимо ли в отношениях иметь друзей противоположного пола?* \n\n'
                '1. Да, они могут быть как у меня, так и у моего партнера. \n\n'
                '2. Нет, я не приемлю разнополой дружбы.',
        'btns': [
            {
                'text': 'Да',
                'value': '1'
            },
            {
                'text': 'Нет',
                'value': '2'

            }
        ]
    },
    {
        'text': '*Какое из утверждений Вы считаете наиболее верным на начальном этапе знакомств?* \n\n'
                '1. Оказывая знаки внимания, мужчина должен добиваться расположения женщины. \n\n'
                '2. Оба собеседника в равной мере должны быть заинтересованы в общении, процесс знакомства не обязывает собеседников ни к чему, кроме честности и уважения.',
        'btns': [
            {
                'text': 'Вариант 1',
                'value': '1'
            },
            {
                'text': 'Вариант 2',
                'value': '2'
            }
        ]
    },
    {
        'text': '*Укажите в порядке приоритетности качества, которыми должен обладать мужчина (от важного к менее важному)* \n\n',
        'btns': [
            {
                'text': 'Лидер',
                'value': '1'
            },
            {
                'text': 'Щедрый',
                'value': '2'
            },
            {
                'text': 'Заботливый',
                'value': '3'
            }
        ]
    },
    {
        'text': '*Женщина, работающая вне дома, должна:* \n\n'
                '1. Быть готова выполнять и домашние обязанности. \n\n'
                '2. Выполнять домашние обязанности только при содействии мужчины. \n\n'
                '3. Разделять домашние обязанности пополам с мужчиной. \n\n'
                '4. Работа по дому не является обязанностью женщины.',
        'btns': [
            {
                'text': 'Вариант 1',
                'value': '1'
            },
            {
                'text': 'Вариант 2',
                'value': '2'
            },
            {
                'text': 'Вариант 3',
                'value': '3'
            },
            {
                'text': 'Вариант 4',
                'value': '4'
            }
        ]
    },
    {
        'text': '*Какое из утверждений ты считаешь наиболее верным?* \n\n'
                '1. Важнее понимать друг друга с полуслова, чем напрямую объяснять причины недопониманий \n\n'
                '2. Проще высказаться прямо, чем постоянно пытаться угадывать желания партнера',
        'btns': [
            {
                'text': '1. Понимать с полуслова',
                'value': '1'
            },
            {
                'text': '2. Высказываться прямо',
                'value': '2'
            }
        ]
    },
    {
        'text': '*Утро выходного дня чаще всего Вы предпочитаете* \n\n'
                '1. Просыпаться до полудня \n\n'
                '2. Отсыпаться до победного',
        'btns': [
            {
                'text': '1. Проснуться раньше',
                'value': '1'
            },
            {
                'text': '2. Поспать',
                'value': '2'
            }
        ]
    }
]

test_5 = {
    'Мужской': ['Дети', 'Карьера', 'Жена', 'Друзья', 'Религия', 'Родители', 'Домашние животные'],
    'Женский': ['Дети', 'Карьера', 'Муж', 'Друзья', 'Религия', 'Родители', 'Домашние животные']
}

interests = [
    ['ЗОЖ', 'Кулинария', 'Танцы', 'Музыка', 'Пение', 'Шопинг', 'Мода', 'Вечеринки', 'Макияж', 'Тату', 'Психология', 'Эзотерика', 'Медитация', 'Астрология'],
    ['Поэзия', 'Проза', 'Искусство', 'История', 'Религия', 'Традиции', 'Путешествия', 'Образование', 'Языки', 'Медицина', 'Наука', 'Бизнес', 'Политика', 'Право'],
    ['Патриотизм', 'Космполитизм', 'Феминизм', 'Рукоделие', 'Садоводство', 'Мастер на все руки', 'Техника', 'Автомобили', 'Мотоциклы', 'Экстрим', 'Футбол', 'Покер', 'Блот', 'Казино'],
    ['Настольные игры', 'Аниме', 'Гейминг', 'Блогинг']
]